chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx450f128h.h
PLIB_INLINE SFR_DATA _USB_EP4_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP7_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP7_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP7_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP7_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP7_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP7_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP8_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP8_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP8_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP8_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP8_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP8_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP9_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP9_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP9_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

